{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 192, 192, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "front_conv_7x7_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_conv_7x7_x1", "strides": [2, 2], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [7, 7], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_conv_7x7_x1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "front_residual_x1convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x1convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x1convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "front_residual_x1convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x1convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x1convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "front_residual_x1convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x1convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x1convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "class_name": "Add"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "front_residual_x2convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x2convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x2convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "front_residual_x2convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x2convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x2convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "front_residual_x2convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x2convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x2convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["max_pooling2d_1", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "class_name": "Add"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "front_residual_x3convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x3convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x3convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "front_residual_x3convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x3convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x3convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "front_residual_x3convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x3convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["front_residual_x3convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "front_residual_x3skipLayer_skip_conv", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "front_residual_x3skipLayer_skip_conv", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["front_residual_x3skipLayer_skip_conv", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "class_name": "Add"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "hg_0_l1convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l1convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l1convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "hg_0_l1convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l1convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l1convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_12", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "hg_0_l1convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l1convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l1convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_13", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["add_3", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "class_name": "Add"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "hg_0_l2convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l2convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l2convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_14", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "hg_0_l2convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l2convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l2convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_15", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "hg_0_l2convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l2convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l2convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_16", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "class_name": "Add"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "hg_0_l4convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l4convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l4convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_17", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "hg_0_l4convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l4convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l4convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_18", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "hg_0_l4convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l4convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l4convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_19", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "class_name": "Add"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "hg_0_l8convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l8convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l8convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_20", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "hg_0_l8convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l8convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l8convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_21", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "hg_0_l8convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_l8convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_l8convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_22", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}], ["max_pooling2d_4", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "class_name": "Add"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "hg_0lf8_resi_x1_convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x1_convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x1_convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_26", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "hg_0lf8_resi_x1_convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x1_convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x1_convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_27", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "hg_0lf8_resi_x1_convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x1_convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x1_convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_28", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["add_7", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "class_name": "Add"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "hg_0lf8_resi_x2_convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x2_convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x2_convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_29", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "hg_0lf8_resi_x2_convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x2_convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x2_convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_30", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "hg_0lf8_resi_x2_convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x2_convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x2_convBlock_conv_1x1_x3", 0, 0, {}]]], "name": "batch_normalization_31", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_31", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_31", 0, 0, {}], ["add_9", 0, 0, {}]]], "name": "add_10", "config": {"trainable": true, "name": "add_10"}, "class_name": "Add"}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "hg_0lf8_resi_x3_convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x3_convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "hg_0_lf8convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_lf8convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0lf8_resi_x3_convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_32", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_32", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["hg_0_lf8convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_23", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "hg_0_rf4_connect_left_resi_convBlock_conv_1x1_x1", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_rf4_connect_left_resi_convBlock_conv_1x1_x1", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "hg_0lf8_resi_x3_convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x3_convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "hg_0_lf8convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_lf8convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["hg_0_rf4_connect_left_resi_convBlock_conv_1x1_x1", 0, 0, {}]]], "name": "batch_normalization_35", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_35", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["hg_0lf8_resi_x3_convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_33", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_33", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["hg_0_lf8convBlock_conv_3x3_x2", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_24", "center": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "hg_0_rf4_connect_left_resi_convBlock_conv_3x3_x2", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0_rf4_connect_left_resi_convBlock_conv_3x3_x2", "strides": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "name": "hg_0lf8_resi_x3_convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "hg_0lf8_resi_x3_convBlock_conv_1x1_x3", "strides": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "hg_0_lf8convBlock_conv_1x1_x3", "config": {"padding": "same", "use_bias": true, "trainable": true, "activity_regularizer": null, 