{
  "modelTopology": {
    "keras_version": "2.1.6",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "input_layers": [
          [
            "input_2",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "config": {
              "batch_input_shape": [
                null,
                256,
                256,
                3
              ],
              "sparse": false,
              "dtype": "float32",
              "name": "input_2"
            },
            "name": "input_2"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "input_2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 64,
              "data_format": "channels_last",
              "kernel_size": [
                7,
                7
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                2,
                2
              ],
              "name": "front_conv_7x7_x1",
              "bias_regularizer": null
            },
            "name": "front_conv_7x7_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_conv_7x7_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_97"
            },
            "name": "batch_normalization_97"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_97",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 64,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x1convBlock_conv_1x1_x1",
              "bias_regularizer": null
            },
            "name": "front_residual_x1convBlock_conv_1x1_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x1convBlock_conv_1x1_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_98"
            },
            "name": "batch_normalization_98"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_98",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 64,
              "data_format": "channels_last",
              "kernel_size": [
                3,
                3
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x1convBlock_conv_3x3_x2",
              "bias_regularizer": null
            },
            "name": "front_residual_x1convBlock_conv_3x3_x2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x1convBlock_conv_3x3_x2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_99"
            },
            "name": "batch_normalization_99"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_99",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x1convBlock_conv_1x1_x3",
              "bias_regularizer": null
            },
            "name": "front_residual_x1convBlock_conv_1x1_x3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x1convBlock_conv_1x1_x3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_100"
            },
            "name": "batch_normalization_100"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_97",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x1skipLayer_skip_conv",
              "bias_regularizer": null
            },
            "name": "front_residual_x1skipLayer_skip_conv"
          },
          {
            "class_name": "Add",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_100",
                  0,
                  0,
                  {}
                ],
                [
                  "front_residual_x1skipLayer_skip_conv",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "name": "add_42"
            },
            "name": "add_42"
          },
          {
            "class_name": "MaxPooling2D",
            "inbound_nodes": [
              [
                [
                  "add_42",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "name": "max_pooling2d_8"
            },
            "name": "max_pooling2d_8"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "max_pooling2d_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 64,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x2convBlock_conv_1x1_x1",
              "bias_regularizer": null
            },
            "name": "front_residual_x2convBlock_conv_1x1_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x2convBlock_conv_1x1_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_101"
            },
            "name": "batch_normalization_101"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_101",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 64,
              "data_format": "channels_last",
              "kernel_size": [
                3,
                3
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x2convBlock_conv_3x3_x2",
              "bias_regularizer": null
            },
            "name": "front_residual_x2convBlock_conv_3x3_x2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x2convBlock_conv_3x3_x2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_102"
            },
            "name": "batch_normalization_102"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_102",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x2convBlock_conv_1x1_x3",
              "bias_regularizer": null
            },
            "name": "front_residual_x2convBlock_conv_1x1_x3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x2convBlock_conv_1x1_x3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_103"
            },
            "name": "batch_normalization_103"
          },
          {
            "class_name": "Add",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_103",
                  0,
                  0,
                  {}
                ],
                [
                  "max_pooling2d_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "name": "add_43"
            },
            "name": "add_43"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "add_43",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x3convBlock_conv_1x1_x1",
              "bias_regularizer": null
            },
            "name": "front_residual_x3convBlock_conv_1x1_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x3convBlock_conv_1x1_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_104"
            },
            "name": "batch_normalization_104"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_104",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                3,
                3
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x3convBlock_conv_3x3_x2",
              "bias_regularizer": null
            },
            "name": "front_residual_x3convBlock_conv_3x3_x2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x3convBlock_conv_3x3_x2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_105"
            },
            "name": "batch_normalization_105"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_105",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 256,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x3convBlock_conv_1x1_x3",
              "bias_regularizer": null
            },
            "name": "front_residual_x3convBlock_conv_1x1_x3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "front_residual_x3convBlock_conv_1x1_x3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_106"
            },
            "name": "batch_normalization_106"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "add_43",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 256,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "front_residual_x3skipLayer_skip_conv",
              "bias_regularizer": null
            },
            "name": "front_residual_x3skipLayer_skip_conv"
          },
          {
            "class_name": "Add",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_106",
                  0,
                  0,
                  {}
                ],
                [
                  "front_residual_x3skipLayer_skip_conv",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "name": "add_44"
            },
            "name": "add_44"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "add_44",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "hg_0_l1convBlock_conv_1x1_x1",
              "bias_regularizer": null
            },
            "name": "hg_0_l1convBlock_conv_1x1_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "hg_0_l1convBlock_conv_1x1_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_107"
            },
            "name": "batch_normalization_107"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_107",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                3,
                3
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "hg_0_l1convBlock_conv_3x3_x2",
              "bias_regularizer": null
            },
            "name": "hg_0_l1convBlock_conv_3x3_x2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "hg_0_l1convBlock_conv_3x3_x2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_108"
            },
            "name": "batch_normalization_108"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_108",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 256,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "hg_0_l1convBlock_conv_1x1_x3",
              "bias_regularizer": null
            },
            "name": "hg_0_l1convBlock_conv_1x1_x3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "hg_0_l1convBlock_conv_1x1_x3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_109"
            },
            "name": "batch_normalization_109"
          },
          {
            "class_name": "Add",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_109",
                  0,
                  0,
                  {}
                ],
                [
                  "add_44",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "name": "add_45"
            },
            "name": "add_45"
          },
          {
            "class_name": "MaxPooling2D",
            "inbound_nodes": [
              [
                [
                  "add_45",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "trainable": true,
              "data_format": "channels_last",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "name": "max_pooling2d_9"
            },
            "name": "max_pooling2d_9"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "max_pooling2d_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                1,
                1
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "hg_0_l2convBlock_conv_1x1_x1",
              "bias_regularizer": null
            },
            "name": "hg_0_l2convBlock_conv_1x1_x1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "hg_0_l2convBlock_conv_1x1_x1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "axis": -1,
              "center": true,
              "beta_constraint": null,
              "momentum": 0.99,
              "beta_regularizer": null,
              "gamma_constraint": null,
              "trainable": true,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "name": "batch_normalization_110"
            },
            "name": "batch_normalization_110"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_110",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "filters": 128,
              "data_format": "channels_last",
              "kernel_size": [
                3,
                3
              ],
              "use_bias": true,
              "padding": "same",
              "kernel_regularizer": null,
              "activity_regularizer": null,
              "trainable": true,
              "dilation_rate": [
                1,
                1
              ],
              "kernel_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null,
                  "distribution": "uniform"
                }
              },
              "bias_constraint": null,
              "activation": "relu",
              "strides": [
                1,
                1
              ],
              "name": "hg_0_l2convBlock_conv_3x3_x2",
              "bias_regularizer": null
            },
            "name": "hg_0_l2convBlock_conv_3x3_x2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "hg_0_l2convBlock_conv_3x3_x2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
