{
  "modelTopology": {
    "keras_version": "2.1.6",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_2",
        "layers": [
          {
            "name": "input_1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                320,
                320,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "inbound_nodes": []
          },
          {
            "name": "conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "conv1",
              "trainable": true,
              "filters": 24,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "maxpool1",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "maxpool1",
              "trainable": true,
              "pool_size": [
                3,
                3
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/1x1conv_1",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block1/1x1conv_1",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "maxpool1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/bn_1x1conv_1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block1/bn_1x1conv_1",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/relu_1x1conv_1",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block1/relu_1x1conv_1",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/bn_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/3x3dwconv",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "stage2/block1/3x3dwconv",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/relu_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/3x3dwconv_2",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "stage2/block1/3x3dwconv_2",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "maxpool1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/bn_3x3dwconv",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block1/bn_3x3dwconv",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/bn_3x3dwconv_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block1/bn_3x3dwconv_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/3x3dwconv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/1x1conv_2",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block1/1x1conv_2",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/bn_3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/1x1_conv_3",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block1/1x1_conv_3",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/bn_3x3dwconv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/bn_1x1conv_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block1/bn_1x1conv_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/bn_1x1conv_3",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block1/bn_1x1conv_3",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/1x1_conv_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/relu_1x1conv_2",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block1/relu_1x1conv_2",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/bn_1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/relu_1x1conv_3",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block1/relu_1x1conv_3",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/bn_1x1conv_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/concat_2",
            "class_name": "Concatenate",
            "config": {
              "name": "stage2/block1/concat_2",
              "trainable": true,
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/relu_1x1conv_2",
                  0,
                  0,
                  {}
                ],
                [
                  "stage2/block1/relu_1x1conv_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block1/channel_shuffle",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block1/channel_shuffle",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAABQAAAAcAAABDAAAAc1oAAAB8AGoAagGDAGQBZACFAhkAXAN9AX0CfQN8A2QCGgB9\nBHQCagN8AGQGfAF8AmQCfARnBYMCfQB0AmoEfABkB4MCfQB0AmoDfABkCHwBfAJ8A2cEgwJ9AHwA\nUwApCU7pAQAAAOkCAAAA6QAAAADpBAAAAOkDAAAA6f////8pBXIDAAAAcgEAAAByAgAAAHIEAAAA\ncgUAAAByBgAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9kaW1lbnNp\nb25zKQXaAXjaBmhlaWdodNoFd2lkdGjaCGNoYW5uZWxz2hJjaGFubmVsc19wZXJfc3BsaXSpAHIR\nAAAA+kkvaG9tZS9nYW9saWp1bi93b3Jrc3BhY2Uvd19mYWNlX2RldGVjdGlvbi9zcmMveW9sbzNf\nbW9kZWxfc2h1ZmZsZW5ldHYyLnB52hBfY2hhbm5lbF9zaHVmZmxlGAAAAHMMAAAAAAEYAQgBFgEM\nARQB\n",
                null,
                null
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/concat_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/spl/sp1_slice",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block2/spl/sp1_slice",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAAAQAAAAYAAAATAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAogAZACFAmYEGQBT\nACkBTqkAKQHaAXopAdoCaXByAQAAAPpJL2hvbWUvZ2FvbGlqdW4vd29ya3NwYWNlL3dfZmFjZV9k\nZXRlY3Rpb24vc3JjL3lvbG8zX21vZGVsX3NodWZmbGVuZXR2Mi5wedoIPGxhbWJkYT4UAAAA8wAA\nAAA=\n",
                null,
                [
                  116
                ]
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/channel_shuffle",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/1x1conv_1",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block2/1x1conv_1",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/spl/sp1_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/bn_1x1conv_1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block2/bn_1x1conv_1",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/relu_1x1conv_1",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block2/relu_1x1conv_1",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/bn_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/3x3dwconv",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "stage2/block2/3x3dwconv",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/relu_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/bn_3x3dwconv",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block2/bn_3x3dwconv",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/1x1conv_2",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block2/1x1conv_2",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/bn_3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/bn_1x1conv_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block2/bn_1x1conv_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/relu_1x1conv_2",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block2/relu_1x1conv_2",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/bn_1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/spl/sp0_slice",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block2/spl/sp0_slice",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAAAQAAAAYAAAATAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAmQBiACFAmYEGQBT\nACkCTukAAAAAqQApAdoBeikB2gJpcHICAAAA+kkvaG9tZS9nYW9saWp1bi93b3Jrc3BhY2Uvd19m\nYWNlX2RldGVjdGlvbi9zcmMveW9sbzNfbW9kZWxfc2h1ZmZsZW5ldHYyLnB52gg8bGFtYmRhPhMA\nAADzAAAAAA==\n",
                null,
                [
                  116
                ]
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block1/channel_shuffle",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/concat_1",
            "class_name": "Concatenate",
            "config": {
              "name": "stage2/block2/concat_1",
              "trainable": true,
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/relu_1x1conv_2",
                  0,
                  0,
                  {}
                ],
                [
                  "stage2/block2/spl/sp0_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block2/channel_shuffle",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block2/channel_shuffle",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAABQAAAAcAAABDAAAAc1oAAAB8AGoAagGDAGQBZACFAhkAXAN9AX0CfQN8A2QCGgB9\nBHQCagN8AGQGfAF8AmQCfARnBYMCfQB0AmoEfABkB4MCfQB0AmoDfABkCHwBfAJ8A2cEgwJ9AHwA\nUwApCU7pAQAAAOkCAAAA6QAAAADpBAAAAOkDAAAA6f////8pBXIDAAAAcgEAAAByAgAAAHIEAAAA\ncgUAAAByBgAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9kaW1lbnNp\nb25zKQXaAXjaBmhlaWdodNoFd2lkdGjaCGNoYW5uZWxz2hJjaGFubmVsc19wZXJfc3BsaXSpAHIR\nAAAA+kkvaG9tZS9nYW9saWp1bi93b3Jrc3BhY2Uvd19mYWNlX2RldGVjdGlvbi9zcmMveW9sbzNf\nbW9kZWxfc2h1ZmZsZW5ldHYyLnB52hBfY2hhbm5lbF9zaHVmZmxlGAAAAHMMAAAAAAEYAQgBFgEM\nARQB\n",
                null,
                null
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/concat_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/spl/sp1_slice",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block3/spl/sp1_slice",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAAAQAAAAYAAAATAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAogAZACFAmYEGQBT\nACkBTqkAKQHaAXopAdoCaXByAQAAAPpJL2hvbWUvZ2FvbGlqdW4vd29ya3NwYWNlL3dfZmFjZV9k\nZXRlY3Rpb24vc3JjL3lvbG8zX21vZGVsX3NodWZmbGVuZXR2Mi5wedoIPGxhbWJkYT4UAAAA8wAA\nAAA=\n",
                null,
                [
                  116
                ]
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/channel_shuffle",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/1x1conv_1",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block3/1x1conv_1",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/spl/sp1_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/bn_1x1conv_1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block3/bn_1x1conv_1",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/relu_1x1conv_1",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block3/relu_1x1conv_1",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/bn_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/3x3dwconv",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "stage2/block3/3x3dwconv",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/relu_1x1conv_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/bn_3x3dwconv",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block3/bn_3x3dwconv",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/1x1conv_2",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block3/1x1conv_2",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/bn_3x3dwconv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/bn_1x1conv_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "stage2/block3/bn_1x1conv_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/relu_1x1conv_2",
            "class_name": "Activation",
            "config": {
              "name": "stage2/block3/relu_1x1conv_2",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/bn_1x1conv_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/spl/sp0_slice",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block3/spl/sp0_slice",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAAAQAAAAYAAAATAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAmQBiACFAmYEGQBT\nACkCTukAAAAAqQApAdoBeikB2gJpcHICAAAA+kkvaG9tZS9nYW9saWp1bi93b3Jrc3BhY2Uvd19m\nYWNlX2RldGVjdGlvbi9zcmMveW9sbzNfbW9kZWxfc2h1ZmZsZW5ldHYyLnB52gg8bGFtYmRhPhMA\nAADzAAAAAA==\n",
                null,
                [
                  116
                ]
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block2/channel_shuffle",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/concat_1",
            "class_name": "Concatenate",
            "config": {
              "name": "stage2/block3/concat_1",
              "trainable": true,
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/relu_1x1conv_2",
                  0,
                  0,
                  {}
                ],
                [
                  "stage2/block3/spl/sp0_slice",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block3/channel_shuffle",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block3/channel_shuffle",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAABQAAAAcAAABDAAAAc1oAAAB8AGoAagGDAGQBZACFAhkAXAN9AX0CfQN8A2QCGgB9\nBHQCagN8AGQGfAF8AmQCfARnBYMCfQB0AmoEfABkB4MCfQB0AmoDfABkCHwBfAJ8A2cEgwJ9AHwA\nUwApCU7pAQAAAOkCAAAA6QAAAADpBAAAAOkDAAAA6f////8pBXIDAAAAcgEAAAByAgAAAHIEAAAA\ncgUAAAByBgAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9kaW1lbnNp\nb25zKQXaAXjaBmhlaWdodNoFd2lkdGjaCGNoYW5uZWxz2hJjaGFubmVsc19wZXJfc3BsaXSpAHIR\nAAAA+kkvaG9tZS9nYW9saWp1bi93b3Jrc3BhY2Uvd19mYWNlX2RldGVjdGlvbi9zcmMveW9sbzNf\nbW9kZWxfc2h1ZmZsZW5ldHYyLnB52hBfY2hhbm5lbF9zaHVmZmxlGAAAAHMMAAAAAAEYAQgBFgEM\nARQB\n",
                null,
                null
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/concat_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block4/spl/sp1_slice",
            "class_name": "Lambda",
            "config": {
              "name": "stage2/block4/spl/sp1_slice",
              "trainable": true,
              "function": [
                "4wEAAAAAAAAAAQAAAAYAAAATAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAogAZACFAmYEGQBT\nACkBTqkAKQHaAXopAdoCaXByAQAAAPpJL2hvbWUvZ2FvbGlqdW4vd29ya3NwYWNlL3dfZmFjZV9k\nZXRlY3Rpb24vc3JjL3lvbG8zX21vZGVsX3NodWZmbGVuZXR2Mi5wedoIPGxhbWJkYT4UAAAA8wAA\nAAA=\n",
                null,
                [
                  116
                ]
              ],
              "function_type": "lambda",
              "output_shape": null,
              "output_shape_type": "raw",
              "arguments": {}
            },
            "inbound_nodes": [
              [
                [
                  "stage2/block3/channel_shuffle",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "stage2/block4/1x1conv_1",
            "class_name": "Conv2D",
            "config": {
              "name": "stage2/block4/1x1conv_1",
              "trainable": true,
              "filters": 116,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
