{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 192, 192, 3], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "bottom_conv_3x3_1", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "strides": [2, 2], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "bottom_conv_3x3_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"name": "bottom_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottom_bn_1", "inbound_nodes": [[["bottom_conv_3x3_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottom_relu_1"}, "class_name": "ThresholdedReLU", "name": "bottom_relu_1", "inbound_nodes": [[["bottom_bn_1", 0, 0, {}]]]}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "bottom_conv_3x3_2", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "strides": [2, 2], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "bottom_conv_3x3_2", "inbound_nodes": [[["bottom_relu_1", 0, 0, {}]]]}, {"config": {"name": "bottom_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottom_bn_2", "inbound_nodes": [[["bottom_conv_3x3_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottom_relu_2"}, "class_name": "ThresholdedReLU", "name": "bottom_relu_2", "inbound_nodes": [[["bottom_bn_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottom_layer_0_blockbottleneck_conv1x1_1", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottom_layer_0_blockbottleneck_conv1x1_1", "inbound_nodes": [[["bottom_relu_2", 0, 0, {}]]]}, {"config": {"name": "bottom_layer_0_blockbottleneck_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottom_layer_0_blockbottleneck_bn_1", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv1x1_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottom_layer_0_blockbottleneck_relu_1"}, "class_name": "ThresholdedReLU", "name": "bottom_layer_0_blockbottleneck_relu_1", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottom_layer_0_blockbottleneck_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottom_layer_0_blockbottleneck_conv3x3_2", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_1", 0, 0, {}]]]}, {"config": {"name": "bottom_layer_0_blockbottleneck_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottom_layer_0_blockbottleneck_bn_2", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv3x3_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottom_layer_0_blockbottleneck_relu_2"}, "class_name": "ThresholdedReLU", "name": "bottom_layer_0_blockbottleneck_relu_2", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottom_layer_0_blockbottleneck_conv1x1_3", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 192, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottom_layer_0_blockbottleneck_conv1x1_3", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_1", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 192, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["bottom_relu_2", 0, 0, {}]]]}, {"config": {"name": "bottom_layer_0_blockbottleneck_bn_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottom_layer_0_blockbottleneck_bn_3", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv1x1_3", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_3", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottom_layer_0_blockbottleneck_relu_3"}, "class_name": "ThresholdedReLU", "name": "bottom_layer_0_blockbottleneck_relu_3", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_1_bottleneck_conv1x1_1", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_1_bottleneck_conv1x1_1", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_1_bottleneck_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_1_bottleneck_bn_1", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv1x1_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_1_bottleneck_relu_1"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_1_bottleneck_relu_1", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_1_bottleneck_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_1_bottleneck_conv3x3_2", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_1", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_1_bottleneck_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_1_bottleneck_bn_2", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv3x3_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_1_bottleneck_relu_2"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_1_bottleneck_relu_2", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_1_bottleneck_conv1x1_3", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 192, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_1_bottleneck_conv1x1_3", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_2", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 192, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_1_bottleneck_bn_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_1_bottleneck_bn_3", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv1x1_3", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "name": "add_2", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_1_bottleneck_relu_3"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_1_bottleneck_relu_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_2_bottleneck_conv1x1_1", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_2_bottleneck_conv1x1_1", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_2_bottleneck_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_2_bottleneck_bn_1", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv1x1_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_2_bottleneck_relu_1"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_2_bottleneck_relu_1", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_2_bottleneck_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_2_bottleneck_conv3x3_2", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_1", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_2_bottleneck_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_2_bottleneck_bn_2", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv3x3_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_2_bottleneck_relu_2"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_2_bottleneck_relu_2", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_2_bottleneck_conv1x1_3", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 192, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_2_bottleneck_conv1x1_3", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_3", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 192, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_2_bottleneck_bn_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_2_bottleneck_bn_3", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv1x1_3", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "name": "add_3", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_2_bottleneck_relu_3"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_2_bottleneck_relu_3", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_3_bottleneck_conv1x1_1", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_3_bottleneck_conv1x1_1", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_3_bottleneck_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_3_bottleneck_bn_1", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv1x1_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_3_bottleneck_relu_1"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_3_bottleneck_relu_1", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_3_bottleneck_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_3_bottleneck_conv3x3_2", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_1", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_3_bottleneck_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_3_bottleneck_bn_2", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv3x3_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_3_bottleneck_relu_2"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_3_bottleneck_relu_2", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_2", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bottle_layer_block_3_bottleneck_conv1x1_3", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 192, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "bottle_layer_block_3_bottleneck_conv1x1_3", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "conv2d_4", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 192, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "bottle_layer_block_3_bottleneck_bn_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "bottle_layer_block_3_bottleneck_bn_3", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv1x1_3", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_4"}, "class_name": "Add", "name": "add_4", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "bottle_layer_block_3_bottleneck_relu_3"}, "class_name": "ThresholdedReLU", "name": "bottle_layer_block_3_bottleneck_relu_3", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "stage2_transition_layer_branch1_conv3x3", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "strides": [2, 2], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "stage2_transition_layer_branch1_conv3x3", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"name": "stage2_transition_layer_branch1_bn", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_transition_layer_branch1_bn", "inbound_nodes": [[["stage2_transition_layer_branch1_conv3x3", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_transition_layer_branch1_relu"}, "class_name": "ThresholdedReLU", "name": "stage2_transition_layer_branch1_relu", "inbound_nodes": [[["stage2_transition_layer_branch1_bn", 0, 0, {}]]]}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "stage2_transition_layer_branch0_conv3x3", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "filters": 24, "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "stage2_transition_layer_branch0_conv3x3", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_3", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", "inbound_nodes": [[["stage2_transition_layer_branch1_relu", 0, 0, {}]]]}, {"config": {"name": "stage2_transition_layer_branch0_bn", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_transition_layer_branch0_bn", "inbound_nodes": [[["stage2_transition_layer_branch0_conv3x3", 0, 0, {}]]]}, {"config": {"name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_transition_layer_branch0_relu"}, "class_name": "ThresholdedReLU", "name": "stage2_transition_layer_branch0_relu", "inbound_nodes": [[["stage2_transition_layer_branch0_bn", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1"}, "class_name": "ThresholdedReLU", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 24, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", "inbound_nodes": [[["stage2_transition_layer_branch0_relu", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_2", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "separable_conv2d_2", "inbound_nodes": [[["stage2_transition_layer_branch1_relu", 0, 0, {}]]]}, {"config": {"name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", 0, 0, {}]]]}, {"config": {"name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1"}, "class_name": "ThresholdedReLU", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_9"}, "class_name": "Add", "name": "add_9", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 24, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "separable_conv2d_1", "kernel_size": [1, 1], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 24, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "separable_conv2d_1", "inbound_nodes": [[["stage2_transition_layer_branch0_relu", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2"}, "class_name": "ThresholdedReLU", "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"config": {"name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", 0, 0, {}]]]}, {"config": {"name": "batch_normalization_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "activation": "linear", "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "filters": 48, "strides": [1, 1], "depthwise_constraint": null, "depth_multiplier": 1, "trainable": true, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "SeparableConv2D", "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_5"}, "class_name": "Add", "name": "add_5", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"config": {"name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_2"}, "class_name": "ThresholdedReLU", "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_2", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"config": {"theta": 0.0, "trainable": true, "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_relu_1"}, "class_name": "ThresholdedReLU", "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_relu_1", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", 0, 0, {}]]]}, {"config": {"pointwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "stage2_stage_layer_hr_module_branch_0_block_1_basic_conv3x3_1", "kernel_size": [3, 3], "pointwise_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, 