{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["final_conv1x1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 192, 192, 3], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "bottom_conv_3x3_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [2, 2], "use_bias": true, "filters": 48, "name": "bottom_conv_3x3_1", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottom_conv_3x3_1", 0, 0, {}]]], "name": "bottom_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottom_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottom_bn_1", 0, 0, {}]]], "name": "bottom_relu_1", "config": {"theta": 0.0, "name": "bottom_relu_1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottom_relu_1", 0, 0, {}]]], "name": "bottom_conv_3x3_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [2, 2], "use_bias": true, "filters": 48, "name": "bottom_conv_3x3_2", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottom_conv_3x3_2", 0, 0, {}]]], "name": "bottom_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottom_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottom_bn_2", 0, 0, {}]]], "name": "bottom_relu_2", "config": {"theta": 0.0, "name": "bottom_relu_2", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottom_relu_2", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_conv1x1_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottom_layer_0_blockbottleneck_conv1x1_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv1x1_1", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottom_layer_0_blockbottleneck_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_1", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_relu_1", "config": {"theta": 0.0, "name": "bottom_layer_0_blockbottleneck_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_1", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottom_layer_0_blockbottleneck_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv3x3_2", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottom_layer_0_blockbottleneck_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_2", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_relu_2", "config": {"theta": 0.0, "name": "bottom_layer_0_blockbottleneck_relu_2", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_2", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_conv1x1_3", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottom_layer_0_blockbottleneck_conv1x1_3", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottom_relu_2", 0, 0, {}]]], "name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "name": "conv2d_1", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_conv1x1_3", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_bn_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottom_layer_0_blockbottleneck_bn_3", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "Add", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_bn_3", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "add_1", "config": {"name": "add_1", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "bottom_layer_0_blockbottleneck_relu_3", "config": {"theta": 0.0, "name": "bottom_layer_0_blockbottleneck_relu_3", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_3", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_conv1x1_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_1_bottleneck_conv1x1_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv1x1_1", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_1_bottleneck_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_1", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_relu_1", "config": {"theta": 0.0, "name": "bottle_layer_block_1_bottleneck_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_1", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_1_bottleneck_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv3x3_2", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_1_bottleneck_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_2", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_relu_2", "config": {"theta": 0.0, "name": "bottle_layer_block_1_bottleneck_relu_2", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_2", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_conv1x1_3", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_1_bottleneck_conv1x1_3", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottom_layer_0_blockbottleneck_relu_3", 0, 0, {}]]], "name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "name": "conv2d_2", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_conv1x1_3", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_bn_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_1_bottleneck_bn_3", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "Add", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "add_2", "config": {"name": "add_2", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "bottle_layer_block_1_bottleneck_relu_3", "config": {"theta": 0.0, "name": "bottle_layer_block_1_bottleneck_relu_3", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_3", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_conv1x1_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_2_bottleneck_conv1x1_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv1x1_1", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_2_bottleneck_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_1", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_relu_1", "config": {"theta": 0.0, "name": "bottle_layer_block_2_bottleneck_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_1", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_2_bottleneck_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv3x3_2", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_2_bottleneck_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_2", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_relu_2", "config": {"theta": 0.0, "name": "bottle_layer_block_2_bottleneck_relu_2", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_2", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_conv1x1_3", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_2_bottleneck_conv1x1_3", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottle_layer_block_1_bottleneck_relu_3", 0, 0, {}]]], "name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "name": "conv2d_3", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_conv1x1_3", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_bn_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_2_bottleneck_bn_3", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "Add", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_3", "config": {"name": "add_3", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "bottle_layer_block_2_bottleneck_relu_3", "config": {"theta": 0.0, "name": "bottle_layer_block_2_bottleneck_relu_3", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_3", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_conv1x1_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_3_bottleneck_conv1x1_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv1x1_1", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_3_bottleneck_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_1", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_relu_1", "config": {"theta": 0.0, "name": "bottle_layer_block_3_bottleneck_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_1", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_3_bottleneck_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv3x3_2", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_3_bottleneck_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_2", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_relu_2", "config": {"theta": 0.0, "name": "bottle_layer_block_3_bottleneck_relu_2", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_2", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_conv1x1_3", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "depthwise_constraint": null, "activity_regularizer": null, "name": "bottle_layer_block_3_bottleneck_conv1x1_3", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottle_layer_block_2_bottleneck_relu_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 192, "name": "conv2d_4", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_conv1x1_3", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_bn_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bottle_layer_block_3_bottleneck_bn_3", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "Add", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_bn_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]], "name": "add_4", "config": {"name": "add_4", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "bottle_layer_block_3_bottleneck_relu_3", "config": {"theta": 0.0, "name": "bottle_layer_block_3_bottleneck_relu_3", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_3", 0, 0, {}]]], "name": "stage2_transition_layer_branch1_conv3x3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [2, 2], "use_bias": true, "filters": 48, "name": "stage2_transition_layer_branch1_conv3x3", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_transition_layer_branch1_conv3x3", 0, 0, {}]]], "name": "stage2_transition_layer_branch1_bn", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_transition_layer_branch1_bn", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["stage2_transition_layer_branch1_bn", 0, 0, {}]]], "name": "stage2_transition_layer_branch1_relu", "config": {"theta": 0.0, "name": "stage2_transition_layer_branch1_relu", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["bottle_layer_block_3_bottleneck_relu_3", 0, 0, {}]]], "name": "stage2_transition_layer_branch0_conv3x3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 24, "name": "stage2_transition_layer_branch0_conv3x3", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_transition_layer_branch1_relu", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_transition_layer_branch0_conv3x3", 0, 0, {}]]], "name": "stage2_transition_layer_branch0_bn", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_transition_layer_branch0_bn", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["stage2_transition_layer_branch0_bn", 0, 0, {}]]], "name": "stage2_transition_layer_branch0_relu", "config": {"theta": 0.0, "name": "stage2_transition_layer_branch0_relu", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1", "config": {"theta": 0.0, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_transition_layer_branch0_relu", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 24, "depthwise_constraint": null, "activity_regularizer": null, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_transition_layer_branch1_relu", 0, 0, {}]]], "name": "separable_conv2d_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "separable_conv2d_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_conv3x3_2", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1", "config": {"theta": 0.0, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1", "trainable": true}}, {"class_name": "Add", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_bn_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "name": "add_9", "config": {"name": "add_9", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 24, "depthwise_constraint": null, "activity_regularizer": null, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_transition_layer_branch0_relu", 0, 0, {}]]], "name": "separable_conv2d_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 24, "depthwise_constraint": null, "activity_regularizer": null, "name": "separable_conv2d_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2", "config": {"theta": 0.0, "name": "stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2", "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_conv3x3_2", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_0_basic_relu_2", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 48, "depthwise_constraint": null, "activity_regularizer": null, "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", "depth_multiplier": 1, "activation": "linear", "pointwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Add", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_bn_2", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_5", "config": {"name": "add_5", "trainable": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_1_basic_conv3x3_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "beta_constraint": null}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_2", "config": {"theta": 0.0, "name": "stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_2", "trainable": true}}, {"class_name": "ThresholdedReLU", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_1_block_1_basic_bn_1", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_relu_1", "config": {"theta": 0.0, "name": "stage2_stage_layer_hr_module_branch_1_block_1_basic_relu_1", "trainable": true}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["stage2_stage_layer_hr_module_branch_0_block_0_basic_relu_2", 0, 0, {}]]], "name": "stage2_stage_layer_hr_module_branch_0_block_1_basic_conv3x3_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, 